public class HelloWorld{
//объявление класса (public значит доступный всем, название файла должно быть таким же!)
	public static void main(String[] args){
//метод main - точка входа в программу этот метод принимает массив строк
//модификатор static - метод можно вызывать не создавая экз содержаего его класса
//void - метод не возвращает никакого значения
//String - встроенный тип предствляющий строку символов
		String name = "Liza";
		System.out.println("Hello world!" + name);
		
//точка входа в программу
	}
}
