/*for (var rabbits = 0; rabbits < 10; rabbits++) {
    console.log(rabbits + ' кролик(ов)');
} //цикл for

var rabbits = 0;

while (rabbits < 10) {
    rabbits++;
    console.log(rabbits + ' кролик(ов)');
} //цикл while*/



/*for (var i = 2; i<= 10; i++){
//увеличивает значение первого множителя в произведении
    for (var j = 2; j <= 10; j++) {
        //увеличивает значение второго множителя в произведении
        console.log(i + '*' + j + ' = ' + i * j);
    }
    //происходит умножение фиксированного i на меняющеюся j и вывод получившегося значения на страницу.

    //Как только значение j достигает 11 выполнение внутреннего цикла прекращается, мы отступаем одну строчку и внешний цикл начинает новую итерацию, множитель (i) увеличивается на 1.

    //За одну итерацию внешнего цикла внутренний делает девять.


    console.log('<br />');
} //вложенный цикл */



//Дан объект obj с ключами 'Минск', 'Москва', 'Киев' с элементами 'Беларусь', 'Россия', 'Украина'. С помощью цикла for-in выведите на экран строки такого формата: 'Минск - это Беларусь.'.

/*var obj = {
    'Минск': 'Беларусии',
    'Москва': 'России',
    'Киев': 'Украины'
};

for (var key in obj)
{
    console.log(key + ' - это столица ' + obj[key] + '.');
}*/